Project/Toir/src/Reports/торо_СостояниеОборудования/торо_СостояниеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_СостояниеОборудования</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <resources>
    <name>ДопустимыйМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначенияКонтролируемыхПоказателейИзОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗамера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПараметрыНаработкиОбъектовРемонта/торо_ПараметрыНаработкиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПараметрыНаработкиОбъектовРемонта</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПлановаяНаработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПлановойНаработки</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПродолжительностьПериодаПлановойНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентИспользованияОборудования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ЗначениеУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Reports/торо_СостояниеОборудования/ObjectModule.bsl
Перем ТекущиеНастройкиОтчета;

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере 				   = Истина;
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек         = Истина;
	Настройки.События.ПриОпределенииПараметровВыбора               = Истина;
	Настройки.События.ПередЗаполнениемПанелиБыстрыхНастроек 	   = Истина;
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = ЗагрузитьНастройкиПриИзмененииПараметров();
	
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	НастройкиСтруктура = КомпоновщикНастроек.Настройки.Структура;
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы, НастройкиСтруктура, Форма, КомпоновщикНастроек);
		
КонецПроцедуры

Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	НастройкиСтруктура = КомпоновщикНастроек.Настройки.Структура;
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы, НастройкиСтруктура, Форма, КомпоновщикНастроек);
	
КонецПроцедуры

Процедура ПередЗаполнениемПанелиБыстрыхНастроек (Форма, ПараметрыЗаполнения) Экспорт
	
	КомпоновщикНастроекТекущий = Форма.Отчет.КомпоновщикНастроек;
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроекТекущий.ПользовательскиеНастройки.Элементы;
	НастройкиСтруктура = КомпоновщикНастроекТекущий.Настройки.Структура;
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы, НастройкиСтруктура, Форма, КомпоновщикНастроекТекущий);
	
КонецПроцедуры

Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
	ПоказателиФО = ПолучитьФункциональнуюОпцию("торо_УчетКонтролируемыхПоказателей");
	НаработкаФО = ПолучитьФункциональнуюОпцию("торо_УчетНаработкиОборудования");
	
	ИДНастройки_ПериодОтчета = Неопределено;
	
	Попытка
		КомпоновщикНастроекТекущий = Форма.КомпоновщикНастроек;
	Исключение
		КомпоновщикНастроекТекущий = Форма.Отчет.КомпоновщикНастроек;
	КонецПопытки;
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроекТекущий.ПользовательскиеНастройки.Элементы;
	
	Для каждого Элемент из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			
			Если Строка(Элемент.Параметр) = "ПериодВыполнени" Тогда
				ИДНастройки_ПериодОтчета = СтрЗаменить(Элемент.ИдентификаторПользовательскойНастройки, "-", "");
			ИначеЕсли Строка(Элемент.Параметр) = "КонтролируемыеПоказатели" 
				ИЛИ Строка(Элемент.Параметр) = "ПоказательНаработки" Тогда   
				
				Если Форма.ТипФормыОтчета <> ТипФормыОтчета.Настройка Тогда
					Продолжить;
				КонецЕсли;
				
				ЭлементНастройки = ОтчетыКлиентСервер.ПолучитьОбъектПоПользовательскомуИдентификатору(
					КомпоновщикНастроекТекущий.Настройки,
					Элемент.ИдентификаторПользовательскойНастройки,,
					КомпоновщикНастроекТекущий.ПользовательскиеНастройки);
				
				ОписаниеНастройки = ОтчетыКлиентСервер.НайтиДоступнуюНастройку(КомпоновщикНастроекТекущий.Настройки, ЭлементНастройки);
				
				Если ТипЗнч(Элемент.Значение) = Тип("СписокЗначений") И ТипЗнч(ОписаниеНастройки.ДоступныеЗначения) = Тип("СписокЗначений") Тогда
					// Выбранные значения не удаляются из списка при смене ОР, даже если их нет у этого ОР.
					// Поэтому проверим и очистим сами.
					МассивДляУдаления = Новый Массив;
					Для каждого ЭлементСписка из Элемент.Значение Цикл
						Если ОписаниеНастройки.ДоступныеЗначения.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда
							МассивДляУдаления.Добавить(ЭлементСписка);
						КонецЕсли;
					КонецЦикла;
					
					Для каждого ЭлементДляУдаления из МассивДляУдаления Цикл
						Элемент.Значение.Удалить(ЭлементДляУдаления);
					КонецЦикла;
					
					ПутьКЭлементуФормы = Форма.ПутьКДаннымЭлементов.ПоИндексу[ПользовательскиеНастройкиЭлементы.Индекс(Элемент)];
					Если ПутьКЭлементуФормы <> Неопределено Тогда
						ЭлементФормы = Форма[ПутьКЭлементуФормы];
						
						МассивДляУдаления = Новый Массив;
						Для каждого ЭлементСписка из ЭлементФормы Цикл
							Если ОписаниеНастройки.ДоступныеЗначения.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда
								МассивДляУдаления.Добавить(ЭлементСписка);
							КонецЕсли;
						КонецЦикла;
						
						Для каждого ЭлементДляУдаления из МассивДляУдаления Цикл
							ЭлементФормы.Удалить(ЭлементДляУдаления);
						КонецЦикла;	
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
		
	Для каждого Элем Из Форма.Элементы Цикл 		
		Если ЗначениеЗаполнено(ИДНастройки_ПериодОтчета) 
			И Найти(Элем.Имя, ИДНастройки_ПериодОтчета) > 0 Тогда
			Если ТипЗнч(Элем) = Тип("ГруппаФормы") 
				ИЛИ (ТипЗнч(Элем) = Тип("ПолеФормы") И Элем.Вид = ВидПоляФормы.ПолеВвода) Тогда
				Элем.РастягиватьПоГоризонтали = Истина;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры 

Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	
	Если Строка(СвойстваНастройки.ДоступнаяНастройкаКД.Параметр) = "КонтролируемыеПоказатели" Тогда
		
		ОР = ПолучитьЗначениеПараметраОбъектРемонта(Форма);
		
		Если Не ОР = Неопределено Тогда
			СвойстваНастройки.ЗапросЗначенийВыбора.Текст = "ВЫБРАТЬ
			|	ИзмеряемыеПоказателиОР.Показатель КАК Показатель
			|ИЗ
			|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК ИзмеряемыеПоказателиОР
			|ГДЕ
			|	ИзмеряемыеПоказателиОР.ОбъектРемонта = &ОбъектРемонта
			|	ИЛИ ИзмеряемыеПоказателиОР.ОбъектРемонта = &ТиповойОР";
			СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("ОбъектРемонта", ОР);
			СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("ТиповойОР", ОР.ТиповойОР);		
		Иначе
			СвойстваНастройки.ЗапросЗначенийВыбора.Текст = "ВЫБРАТЬ
			|	ИзмеряемыеПоказателиОР.Показатель КАК Показатель
			|ИЗ
			|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК ИзмеряемыеПоказателиОР";
		КонецЕсли; 
		
	ИначеЕсли Строка(СвойстваНастройки.ДоступнаяНастройкаКД.Параметр) = "ПоказательНаработки" Тогда
		
		ОР = ПолучитьЗначениеПараметраОбъектРемонта(Форма);
		
		Если Не ОР = Неопределено Тогда
			СвойстваНастройки.ЗапросЗначенийВыбора.Текст = "ВЫБРАТЬ
			|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель
			|ИЗ
			|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
			|ГДЕ
			|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта";
			СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("ОбъектРемонта", ОР);
		Иначе
			СвойстваНастройки.ЗапросЗначенийВыбора.Текст = "ВЫБРАТЬ
			|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель
			|ИЗ
			|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта";
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы, НастройкиСтруктура, Форма, КомпоновщикНастроек) 
	
	ПараметрыВыполнения = Форма.Параметры;
	
	ПоказателиФО = ПолучитьФункциональнуюОпцию("торо_УчетКонтролируемыхПоказателей");
	НаработкаФО = ПолучитьФункциональнуюОпцию("торо_УчетНаработкиОборудования");
	
	Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(Элемент.Параметр) = "ОбъектРемонта" Тогда
				
				Если ПараметрыВыполнения.Свойство("ОбъектРемонта") Тогда
					Элемент.Значение      = ПараметрыВыполнения.ОбъектРемонта;
					Элемент.Использование = Истина;			
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли Строка(Элемент.Параметр) = "КонтролируемыеПоказатели" И ПоказателиФО Тогда
				
				Если ПараметрыВыполнения.Свойство("ТекПоказатель") Тогда
					ТекПоказатель = Новый СписокЗначений;
					ТекПоказатель.Добавить(ПараметрыВыполнения.ТекПоказатель);
					
					Элемент.Значение = ТекПоказатель;
					Элемент.Использование = Истина;
				Иначе
					ТекПоказатель = Новый СписокЗначений;
					Элемент.Значение = ТекПоказатель;
				КонецЕсли;
				
			ИначеЕсли Строка(Элемент.Параметр) = "ПоказательНаработки" И НаработкаФО Тогда
				
				Если ПараметрыВыполнения.Свойство("ТекПоказательНаработки") Тогда
					ТекПоказатель = Новый СписокЗначений;
					ТекПоказатель.Добавить(ПараметрыВыполнения.ТекПоказательНаработки);
					
					Элемент.Значение = ТекПоказатель;
					Элемент.Использование = Истина;
				Иначе
					ТекПоказатель = Новый СписокЗначений;
					Элемент.Значение = ТекПоказатель;
				КонецЕсли;
				
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Если Не НаработкаФО Тогда
		ОтключитьНастройкиПоНаработке(ПользовательскиеНастройкиЭлементы, НастройкиСтруктура);
	КонецЕсли;
	
	Если Не ПоказателиФО Тогда
		ОтключитьНастройкиПоИзмеряемымПоказателям(ПользовательскиеНастройкиЭлементы, НастройкиСтруктура);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтключитьНастройкиПоНаработке(ПользовательскиеНастройкиЭлементы, НастройкиСтруктура)
	
	Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			И (Строка(Элемент.Параметр) = "ПоказательНаработки"
			ИЛИ Строка(Элемент.Параметр) = "СредняяНаработка")Тогда
			Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			Элемент.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	МассивДляУдаления = Новый Массив;
	Для Каждого Элемент Из НастройкиСтруктура Цикл
		Для Каждого ВыбранноеПоле Из Элемент.Выбор.Элементы Цикл
			Если ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ЗначениеПараметраНаработки") Тогда
				МассивДляУдаления.Добавить(Элемент);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого Элемент из МассивДляУдаления Цикл
		НастройкиСтруктура.Удалить(Элемент);
	КонецЦикла;
		
КонецПроцедуры

Процедура ОтключитьНастройкиПоИзмеряемымПоказателям(ПользовательскиеНастройкиЭлементы, НастройкиСтруктура)
	
	Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			И Строка(Элемент.Параметр) = "КонтролируемыеПоказатели" Тогда
			Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			Элемент.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;	
	
	МассивДляУдаления = Новый Массив;
	Для Каждого Элемент Из НастройкиСтруктура Цикл
		Для Каждого ВыбранноеПоле Из Элемент.Выбор.Элементы Цикл
			Если ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ЗначениеИзмеряемогоПоказателя") Тогда
				МассивДляУдаления.Добавить(Элемент);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого Элемент из МассивДляУдаления Цикл
		НастройкиСтруктура.Удалить(Элемент);
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьЗначениеПараметраОбъектРемонта(Форма)
	
	ОР = Неопределено;
	
	Если Форма = Неопределено Тогда
		ЭлементыНастроек = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Иначе
	   ЭлементыНастроек = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементНастройки Из ЭлементыНастроек Цикл
		Если Строка(ЭлементНастройки.Параметр) = "ОбъектРемонта" Тогда
			ОР = ЭлементНастройки.Значение;
			Если ТипЗнч(ОР) = Тип("СписокЗначений") Тогда
				ОР = ОР[0].Значение;
			КонецЕсли;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат ОР;
	
КонецФункции

Функция ЗагрузитьНастройкиПриИзмененииПараметров()  
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ОбъектРемонта"));	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецЕсли
